#include <iostream> 
using namespace std;

/*
* Идеята е, че брооят начини да се запише едно число
* е сумата от броя на начините да се запишат всички преди
* него. Например:
* 1 се записва по единствен начин -> 1
*
* 2 се записва като: 
*   - едно събираемо (2) = 1 начин
*   - 1 + различните начини да се изпише 1 = 1 начин (1 + 1)
*   - ОБЩО: 2 начина (2; 1 + 1)
*
* 3 се записва като:
*   - едно събираемо (3) = 1 начин
*   - 1 + начините да се изпише 2 = 2 начина (2; 1+1)
*   - 2 + начините да се изпише 1 = 1 начин (1)
*   - ОБЩО: 4 начина (3; 1 + 2; 1 + 1 + 1; 2 + 1)
*
* 4 се записва като:
*   - едно събираемо (4) = 1 начин
*   - 1 + начините да се изпише 3 = 4 начина (3; 1 + 2; 1 + 1 + 1; 2 + 1)
*   - 2 + начините да се изпише 2 = 2 начина (2; 1 + 1)
*   - 3 + начините да се изпише 1 = 1 начин (1)
*   - ОБЩО: 8 начина:
*       4
*       1 + 3; 1 + 1 + 2; 1 + 1 + 1 + 1; 1 + 2 + 1
*       2 + 2; 2 + 1 + 1
*       3 + 1
*/

int sumsCount(int n) 
{
    if(n <= 1)
    {
        return 1;
    }

    int count = 1; // задължително 1 представяне - самото число
    for(int i = 1; i < n; i++)
    {
        // към броя на начините прибавяме последователно
        // начините за представяне на всяко число преди него
        count += sumsCount(n - i);
    }
    return count;
}

int main() 
{
    int n = -1;
    while(n < 0) 
    {
        cout << "Enter a non-negative number: ";
        cin >> n;
    }
    cout << sumsCount(n);
}