#include<iostream>
#include<climits>

using namespace std;

int main() 
{
  // Дефиниция на n
  int n;

  // Въвеждане на n от клавиатурата
  cin >> n;

  // В променливата max ще пазим най-голямата
  // открита до момента стойност, затова в
  // началото я инициализираме с INT_MIN, което
  // е най-малката стойност, която може да се
  // запише в типа int, тоест всяка друга стойност 
  // е >= на INT_MIN.
  int max = INT_MIN;

  for (int i = 0; i < n; i++)
  {
    int num; // дефиниция на текущото число
    cout << "Enter number " << i + 1 << ": ";
    cin >> num; // прочитане на числото

    // сравняваме го с максималната намерена до момента
    // стойност и ако то е по-голямо, го запазваме в нея
    if(num > max)
    {
      max = num;
    }
  }
  
  cout << "The biggest number is " << max << endl;

  return 0;
}