#include<iostream> 

using namespace std;

int main() 
{
  int n; 
  cin >> n;
  
  int sum = 0;

  // Сменяме знака на числото, в случай, че е отрицателно
  if(n < 0)
  {
    n = -n;
  }

  // Tук подобно на предишната подточка цикълът
  // продължава докато числото не е 0, но за разлика
  // от нея, се интересуваме от самата цифра, която сме
  // премахнали, защото трябва да я прибавим към общата сума

  while(n > 0) 
  {
    int lastDigit = n % 10; // отделяме последната цифра
    sum += lastDigit;       // прибавяме последната дифра към сумата
    n /= 10;                // намаляме n с една цифра
  }

  cout << "The sum of the digits is " << sum << endl;

  return 0;
}