#include<iostream>

using namespace std;

int main() 
{
  int number;
  cin >> number;

  bool leadingZero = number%10 == 0;
  /*
  * Да разгледаме няколко примера:
  * 1) 12 = 1*10 + 2
  *    21 = 2*10 + 1
  * 2) 413 = 4*100 + 1*10 + 3 = (4*10 + 1)*10 + 3
  *    314 = 3*100 + 1*10 + 4 = (3*10 + 1)*10 + 4
  * 3) 8932 = 8*1000 + 9*100 + 3*10 + 2 = ((8*10 + 9)*10 + 3)*10 + 2
  *    2389 = 2*1000 + 3*100 + 8*10 + 9 = ((2*10 + 3)*10 + 8)*10 + 9
  * Тоест на всяка стъпка вземаме последната цифра и я прибавяме към
  * полученото до момента, умножено по 10.  
  */

  int result = 0;
  while(number > 0)
  {
    int lastDigit = number % 10; // вземаме последната цифра
    result = (result * 10) + lastDigit; // събираме в резултата по горната формула
    number /= 10;
  }

  if(leadingZero) cout << 0; // извеждаме 0, ако първоначалното число е завършвало с 0
  cout << result << endl;
}