#include<iostream>
#include<cmath>

using namespace std;

int main() 
{
  // Дефиниция на n
  int n;

  // Въвеждане на n от клавиатурата
  cin >> n;

  // Подобно на първата подточка ще пазим в max
  // максималната до момента намерена стойност,
  // но тъй като става въпрос за неотрицателни числа,
  // е достатъчно да инициализираме max с 0
  int max = 0;
  // тук обаче е нужно да пазим и самото число,
  // понеже то е резултатът от задачата, инициализираме
  // го с 0, за да работи програмата в случаите, в които 
  // са ни въвели само нули
  int result = 0;

  for (int i = 0; i < n; i++)
  {
    int num; // дефиниция на текущото число
    cout << "Enter number " << i + 1 << ": ";
    cin >> num; // прочитане на числото

    // сравняваме по абсолютна стойност текущото
    // число и max
    if(abs(num) > max)
    {
      max = abs(num);
      result = num;
    }
  }
  
  cout << "The number with biggest absolute value is " << result << endl;

  return 0;
}